Revit 2027 API
FabricationPart.GetDimensionValue Method
 Gets the value of the fabrication dimension, returns value in Revit internal units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDimensionValue(
	FabricationDimensionDefinition dim
)
Public Function GetDimensionValue (
	dim As FabricationDimensionDefinition
) As Double
public:
double GetDimensionValue(
	FabricationDimensionDefinition^ dim
)
member GetDimensionValue :
        dim : FabricationDimensionDefinition -> float
Parameters
dim FabricationDimensionDefinition
 The fabrication dimension.
Return Value
Double
 The dimension value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace